{"files":{"about.md":{"filePath":"about.md","links":[],"meta":{"page":{"description":"You might think of laziness being a bad thing. Many years ago when I was getting my start, one of my coworkers called me the lazeministrator. Honestly, I can’t remember any more if it was a legitimate slight or a complement but I’ll take and own it now because it fits."},"tags":[]},"parentNote":"index.md","title":"About","url":"about.html"},"blog.md":{"filePath":"blog.md","links":[],"meta":{"tags":[]},"parentNote":"index.md","title":"rants and raves.","url":"blog.html"},"blog/nix-images-at-speed.md":{"filePath":"blog/nix-images-at-speed.md","links":[],"meta":{"date":"2023-05-03","page":{"description":"When I started at a modestly sized, AWS hosted web property several years back, I inherited an environment that was built on Chef. Chef had served the company well enough. It crossed off all the check boxes that the marketing literature specified like being able to configure your Ubuntu host with some ruby code and you can provision hosts without touching them."},"tags":[]},"parentNote":"blog.md","title":"deploying disk images at speed","url":"blog/nix-images-at-speed.html"},"blog/patches-into-configuration.md":{"filePath":"blog/patches-into-configuration.md","links":[],"meta":{"date":"2018-04-05","page":{"description":"I wrote this back in 2018 with the intent to publish but it never made it out. Wildly, 5 years later, the technique would still apply. I don’t use znapzend any longer, but, to keep the story updated, the patch is now irrelevant since upstream changed it to a 10 minute timeout."},"tags":[]},"parentNote":"blog.md","title":"Turning patches into configuration","url":"blog/patches-into-configuration.html"},"blog/why-nix.md":{"filePath":"blog/why-nix.md","links":[],"meta":{"date":"2023-05-01","page":{"description":"I’ve been a Unixy user for the majority of my life. I started out with a Debian 1.2 disk from CheapBytes and I fumbled with that until a group of friends told me to get away from that junk and get onto FreeBSD. Because of that, FreeBSD 4.0 will forever have a place in my heart because the FreeBSD experience was just right."},"tags":[]},"parentNote":"blog.md","title":"Nix makes Linux usable","url":"blog/why-nix.html"},"index.md":{"filePath":"index.md","links":[{"resolvedRelTarget":{"contents":"blog.html","tag":"RRTFound"},"unresolvedRelTarget":{"contents":["WikiLinkNormal","blog"],"tag":"URTWikiLink"}},{"resolvedRelTarget":{"contents":"about.html","tag":"RRTFound"},"unresolvedRelTarget":{"contents":["WikiLinkNormal","about"],"tag":"URTWikiLink"}}],"meta":{"page":{"description":"Not lazy in the way you are probably thinking. I’m taking it back. I mean lazy in the sense where you do as much work as needed in order to not have to do more work in the future. It’s a delicate balance and even has at least one XKCD comic about it. It’s a zen where you work on a task, thinking about all of the ways in the future that it might blow up on you and you take the extra steps to not have that future failure."},"tags":[]},"parentNote":null,"title":"Lazeministrator’s tool kit","url":""}},"version":1}